# 6. Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
# Подсказка: использовать функцию count() и cycle() модуля itertools. Обратите
# внимание, что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть
# условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа
# 10 завершаем цикл. Во втором также необходимо предусмотреть условие, при котором
# повторение элементов списка будет прекращено.

from itertools import count, cycle

# итератор, генерирующий целые числа, начиная с указанного

# user_number = int(input('Ведите целое число:\n'))
# end_number = int(input('Ведите число для завершения цикла:\n'))
#
# for itm in count(user_number):
#     if itm > end_number:
#         break
#     else:
#         print(itm)

# итератор, повторяющий элементы некоторого списка, определенного заранее

с = 0
for el in cycle("-*+$"):
    if с > 10:
        break
    print(el)
    с += 1

