# 1.Реализовать функцию, принимающую два числа (позиционные аргументы)
# и выполняющую их деление. Числа запрашивать у пользователя, предусмотреть
# обработку ситуации деления на ноль.

def divide(x, y):
    """ Функция выполняет деление двух чмсел"""
    try:
        result = x / y
    except ZeroDivisionError:
        print('Деление на ноль')
    else:
        return result

user_numb_1 = int(input('Введите первое число: '))
user_numb_2 = int(input('Введите второе число: '))
print(divide(user_numb_1, user_numb_2))
