# 2. Реализовать функцию, принимающую несколько параметров, описывающих данные
# пользователя: имя, фамилия, год рождения, город проживания, email, телефон.
# Функция должна принимать параметры как именованные аргументы.
# Реализовать вывод данных о пользователе одной строкой.

def user(name, surname, birth_year, city, email, telephone):
    print(f"Имя: {name}, фамилия: {surname}, год рождения: {birth_year}, город проживания: {city}, "
          f"email: {email}, телефон: {telephone}")

user(name='Римма', surname='Мансурова', birth_year=1980, city='Пермь', email='mansrimma@yandex.ru', telephone=8888999999)
