# 4. Программа принимает действительное положительное число x и целое отрицательное
# число y. Необходимо выполнить возведение числа x в степень y. Задание необходимо
# реализовать в виде функции my_func(x, y). При решении задания необходимо обойтись
# без встроенной функции возведения числа в степень.
# Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень
# с помощью оператора **. Второй — более сложная реализация без оператора **,
# предусматривающая использование цикла.

def my_func(x: float, y: int) -> float:
    """ Первый способ"""
    result = x ** y
    return result

def my_func_2(x: float, y: int) -> float:
    """ Второй способ"""
    x = 1 / x
    result_2 = 1
    for itm in range(abs(y)):
        result_2 *= x
    return result_2

print(my_func(2.5, -2))
print(my_func_2(2.5, -2))
