#Реализовать функцию my_func(), которая принимает три позиционных аргумента,
# и возвращает сумму наибольших двух аргументов.

def my_func(x, y, z):
    result = x + y + z - min(x, y, z)
    return result

print(my_func(25, 5, 9))
