# 5. Запросите у пользователя значения выручки и издержек фирмы. Определите, с
# каким финансовым результатом работает фирма (прибыль — выручка больше издержек,
# или убыток — издержки больше выручки). Выведите соответствующее сообщение.
# Если фирма отработала с прибылью, вычислите рентабельность выручки
# (соотношение прибыли к выручке). Далее запросите численность сотрудников фирмы
# и определите прибыль фирмы в расчете на одного сотрудника.

proceeds = int(input('Выручка: '))
costs = int(input('Издержки: '))

if proceeds > costs:
    profit = proceeds - costs
    print('Прибыль: ', profit)
    print('Рентабельность выручки: ', '%.2f' % (profit / proceeds))
    quantity = int(input('Введите количество сотрудников: '))
    print('Прибыль на одного сотрудника: ', '%.2f' % (profit / quantity))
else:
    print('Фирма работает с убытком')
