# 5. Программа запрашивает у пользователя строку чисел, разделенных пробелом.
# При нажатии Enter должна выводиться сумма чисел. Пользователь может продолжить
# ввод чисел, разделенных пробелом и снова нажать Enter. Сумма вновь введенных
# чисел будет добавляться к уже подсчитанной сумме. Но если вместо числа вводится
# специальный символ, выполнение программы завершается. Если специальный символ
# введен после нескольких чисел, то вначале нужно добавить сумму этих чисел к
# полученной ранее сумме и после этого завершить программу

def sum_numb(x: str):
    """Вычмсление суммы"""
    a = [int(s) for s in x.split()]
    result = sum(a)
    return result

# Специальный символ 'n'
next_enter = True
sum_result = 0
while next_enter:
    user_str = input('ведите строку из чисел:\n')
    if user_str == 'n': # если введен спец.символ, то завершить программу
        break
    if user_str[len(user_str)-1] == 'n': # если в конце строки спец.символ, то вычислить сумму чисел и завершить
        sum_result += sum_numb(user_str[:len(user_str)-1])
        print(sum_result)
        break
    sum_result += sum_numb(user_str)
    print(sum_result)
