#1. Создать список и заполнить его элементами различных типов данных. Реализовать
# скрипт проверки типа данных каждого элемента. Использовать функцию type()
# для проверки типа. Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

a = [123, 'home', True, [1, 5, 6], (1, 5, 0), 5.98]

for itm in a:
    print(type(itm))
