#6. *Реализовать структуру данных «Товары». Она должна представлять собой список
# кортежей. Каждый кортеж хранит информацию об отдельном товаре. В кортеже должно
# быть два элемента — номер товара и словарь с параметрами (характеристиками товара:
# название, цена, количество, единица измерения). Структуру нужно сформировать
# программно, т.е. запрашивать все данные у пользователя.
# Необходимо собрать аналитику о товарах. Реализовать словарь, в котором каждый
# ключ — характеристика товара, например название, а значение — список значений-
# характеристик, например список названий товаров.

while True:
    user_numb = input('Введите количество товаров: ')
    if user_numb.isdigit():
        user_numb = int(user_numb)
        break
    else:
        print('Ошибка ввода, это не число')

products = []
for itm in range(user_numb):
    prod_numb = int(input('Введите код товара: '))
    dict ('название'=input('Введите название товара: '),
        'цена'=input('Введите цену товара: '),
        'количество'=input('Введите количество: '),
        'ед'=input('Введите единицу имерения: ')))
    products.append(a)

print(products)
