"""
6. Необходимо создать (не программно) текстовый файл, где каждая строка описывает
 учебный предмет и наличие лекционных, практических и лабораторных занятий по этому
  предмету и их количество. Важно, чтобы для каждого предмета не обязательно были
  все типы занятий. Сформировать словарь, содержащий название предмета и общее
  количество занятий по нему. Вывести словарь на экран.
Примеры строк файла: Информатика:   100(л)   50(пр)   20(лаб).
                                        Физика:   30(л)   —   10(лаб)
                                        Физкультура:   —   30(пр)   —
Пример словаря: {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}
"""

with open('new_file6.txt', 'r', encoding='UTF-8') as file:
    content = file.readlines()

dict = {}
for el in content:
    key = el[:el.find(':')]
    l = len(el)
    integ = []
    i = 0
    while i < l:
        s_int = ''
        a = el[i]
        while '0' <= a <= '9':
            s_int += a
            i += 1
            if i < l:
                a = el[i]
            else:
                break
        i += 1
        if s_int != '':
            integ.append(int(s_int))
    sum_int = sum(integ)
    dict[key] = sum_int
print(dict)
