"""
3. Создать текстовый файл (не программно), построчно записать фамилии сотрудников
 и величину их окладов (не менее 10 строк). Определить, кто из сотрудников имеет
 оклад менее 20 тыс., вывести фамилии этих сотрудников. Выполнить подсчет средней
 величины дохода сотрудников.
Пример файла:
Иванов 23543.12
Петров 13749.32
"""

with open('new_file3.txt', 'r', encoding='UTF-8') as file:
    content = file.readlines()
    count_mean = 0
    for el in content:
        s = el.split()
        if float(s[1]) < 20000:
            print(s[0], s[1])
        count_mean += float(s[1])
    print('Средний доход сотрудников:', count_mean / len(content))
