# 6. Спортсмен занимается ежедневными пробежками. В первый день его результат
# составил a километров. Каждый день спортсмен увеличивал результат на 10 %
# относительно предыдущего. Требуется определить номер дня, на который общий
# результат спортсмена составить не менее b километров. Программа должна принимать
# значения параметров a и b и выводить одно натуральное число — номер дня.

a = int(input('Пробежал в первый день: '))
b = int(input('Введите расстояние в км: '))

day = 1
while a < b:
    day += 1
    a += 0.1 * a
print(f'На {day}-й день спортсмен достиг результата — не менее {b} км')